-- -*- M2-comint -*- hash: 18116463738991251957

i1 : edges = {{1,8},{2,7},{3,6},{4,5},{5,6},{6,7},{7,8},{5,8}};

i2 : reticulations = {{{6,7},{7,8}}};

i3 : leaves = {1,2,3,4};

i4 : exampleNetwork = getNetwork(edges,leaves,reticulations);

i5 : exampleNetwork2 = addNetworkEdge(exampleNetwork,{{1,8},{7,2}},7);

i6 : peek exampleNetwork => peek oo

o6 = Network{leaves => {1, 2, 3, 4}                  } => Network{leaves => {1, 2, 3, 4}                    }
             level => 1                                           level => 2
             reticulation edges => {{{6, 7}, {7, 8}}}             reticulation edges => {{{6, 7}, {7, 8}}  }
             sorted edges => {{1, 8}}                                                   {{{9, 10}, {7, 10}}}
                             {{2, 7}}                             sorted edges => {{1, 9} }
                             {{3, 6}}                                             {{2, 10}}
                             {{4, 5}}                                             {{3, 6} }
                             {{5, 6}}                                             {{4, 5} }
                             {{5, 8}}                                             {{5, 6} }
                             {{6, 7}}                                             {{5, 8} }
                             {{7, 8}}                                             {{6, 7} }
                                                                                  {{7, 8} }
                                                                                  {{7, 10}}
                                                                                  {{8, 9} }
                                                                                  {{9, 10}}

o6 : Option

i7 : edges = {{1,8},{2,7},{3,6},{4,5},{5,6},{6,7},{7,8},{5,8}};

i8 : reticulations = {{{6,7},{7,8}}};

i9 : leaves = {1,2,3,4};

i10 : exampleNetwork = getNetwork(edges,leaves,reticulations);

i11 : exampleNetwork2 = addNetworkEdge(exampleNetwork,{{{1,8},{7,2}},{{3,6},{4,5}}},{7,3});

i12 : peek exampleNetwork => peek oo

o12 = Network{leaves => {1, 2, 3, 4}                  } => Network{leaves => {1, 2, 3, 4}                     }
              level => 1                                           level => 3
              reticulation edges => {{{6, 7}, {7, 8}}}             reticulation edges => {{{6, 7}, {7, 8}}   }
              sorted edges => {{1, 8}}                                                   {{{9, 10}, {7, 10}} }
                              {{2, 7}}                                                   {{{11, 12}, {3, 11}}}
                              {{3, 6}}                             sorted edges => {{1, 9}  }
                              {{4, 5}}                                             {{2, 10} }
                              {{5, 6}}                                             {{3, 11} }
                              {{5, 8}}                                             {{4, 12} }
                              {{6, 7}}                                             {{5, 6}  }
                              {{7, 8}}                                             {{5, 8}  }
                                                                                   {{5, 12} }
                                                                                   {{6, 7}  }
                                                                                   {{6, 11} }
                                                                                   {{7, 8}  }
                                                                                   {{7, 10} }
                                                                                   {{8, 9}  }
                                                                                   {{9, 10} }
                                                                                   {{11, 12}}

o12 : Option

i13 : 
